Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 指鹿为马。
en_us: Pointing to a deer and calling it a horse[ref]A Chinese idiom referring to someone deliberately misrepresenting something. However, it's used in the literal sense here.[/ref].

source: 按照姚老头的说法，姓陈的人最早在小镇有两支，只不过其中一支很早就迁出去，陈平安这一支，以前也旺盛过，只不过这个“以前”实在是太久了，就连姚老头也说不清楚是几百年，五百年，八百年？还是一千年了？后来又分成好几房，人丁越来越稀少，运气大概是都给外迁的那支带走了，香火经常断，以至于许多坟头都渐渐没人看管了，加上大部分坟所在的山头，陆陆续续被朝廷派来的督造官，下令变成了一座座封禁之山。
en_us: According to Old Man Yao, there had originally been two different branches of the Chen Clan in the small town. However, one of the branches had moved out a very long time ago. Meanwhile, the branch that Chen Ping'an belonged to had also flourished at some point in time. However, this was far too long ago. In fact, even Old Man Yao couldn't say how long ago it was. Was it 500 years? Or 800 years? Or was it 1000 years? Afterward, this branch split into several sub-branches, and the overall population also started to gradually decline. Their fortune was perhaps all taken away by the other branch of the Chen Clan. Thus, the bloodlines started to disappear one by one, resulting in many graves being forgotten and abandoned. Not only that, but many of the mountains where the graves were located were sealed off and turned into restricted areas by the kiln supervision officials sent over by the imperial court.

source: 按照小镇流传最广的说法，前任督造官宋大人，业务不精，没能造出让朝廷满意的御用贡瓷，靠着那点苦劳，留下一座廊桥，就回京任职了，当然也留下了宋集薪这个私生子，只给他买了个贴身丫鬟照顾起居，再就是“托孤”给好友，即顶替他位置的新任督造官，听说也姓宋。
en_us: According to the most popular explanation in the small town, the previous kiln supervision official Master Song hadn't been good at running the dragon kilns. Thus, he hadn't been able to produce any imperial wares that the imperial court was satisfied with. After putting in some hard work and constructing that covered bridge, he had returned to the capital to report for duty. Of course, he had also left Song Jixin, his illegitimate son. However, he had only bought him a single maidservant to take care of the chores. Apart from that, he had also "entrusted" this son a friend, the person who was going to replace him as the new kiln supervision official. It was rumored that his surname was also Song.

source: 按照小镇的习俗，女子嫁人时，便会有聘请一位父母子女皆健在的福气齐全人，请她绞去新娘脸上的绒毛，剪齐额发和鬓角，谓之开面，或是升眉。
en_us: According to the traditions of the town, whenever a woman was married, an individual with a full set of blessings would be invited. The definition of such an individual was one whose parents and children were all still alive, and that person would be invited to shave off the fine hairs on the bride's face, as well as to trim her bangs and temples. The procedure was known as face opening, or brow elevating.

source: 按照常理而言，那少年八成是从小上山入水磨砺出来的身手和体力，说不定还研习过粗浅的呼吸吐纳之术，这才有了异于常人的体魄，身轻骨硬，气血强壮，以至于能够跟老猿在巷弄屋顶玩猫抓耗子的游戏，这样的话，去熟稔道路的密林深处躲藏，合情合理，若是纯粹的少年心性，先前不过是凭借一腔热血想要报仇，尝到过轻重厉害之后，逐渐冷却，自然而然开始后怕，便跑去南边的铁匠铺子，寻求阮师的庇护，也情理之中。
en_us: Thinking from a logical perspective, Chen Ping'an had most likely developed his skills and stamina from climbing the mountains and swimming through the creeks since a young age. Perhaps he had even experimented with elementary breathing techniques before, and maybe it was because of this that he possessed such an exceptional physique, with his body light and his bones sturdy. This then allowed him to play the cat and mouse game with Bai Yuan on the rooftops. If this were the case, it made sense for Chen Ping'an to venture deeper into the dense forests to find a hiding spot. If he were nothing more than an ordinary young boy, however, then he had most likely been acting on an impulse to seek revenge before. After witnessing Bai Yuan's strength and calming down a little, it would only be natural for him to feel a sense of lingering fear. As such, it would be no surprise if he ran to the blacksmith shop in the south to seek protection from Master Ruan.

source: 按照这座小镇传承数百年的风俗，如果有蛇类往自家屋子钻，是好兆头，主人绝对不要将其驱逐打杀。宋集薪在正月初一的时候，坐在门槛上晒太阳，然后就有只俗称四脚蛇的小玩意儿，在他的眼皮子底下往屋里窜，宋集薪一把抓住就往院子里摔出去，不曾想那条已经摔得七荤八素的四脚蛇，愈挫愈勇，一次次，把从来不信鬼神之说的宋集薪给气得不行，一怒之下就把它甩到了陈平安院子，哪里想到，宋集薪第二天就在自己床底下，看到了那条盘踞蜷缩起来的四脚蛇。
en_us: According to the customs and traditions that had been passed down for several centuries in the small town, it was a good omen for ophidian creatures to make their way into one's home, and it was considered to be extremely taboo for the owners of such fortunate homes to chase out or kill said creatures. On the first day of the first month on the lunar calendar, Song Jixin had been sunbathing while sitting on his doorstep when a creature colloquially known as a four-legged snake began to scurry into the house right under his nose. [ref]The four-legged snake here refers to a gecko.[/ref] Song Jixin grabbed the creature before throwing it out of the yard, but to his surprise, even though the creature was battered and disoriented from the fall, it seemed to only grow more and more courageous with each failure, attempting to crawl into the house over and over again. Song Jixin had never been one to believe in superstitions, and he was so infuriated by the persistent creature that he threw it into Chen Ping'an's yard in a fit of rage. Much to his bewilderment, he discovered that very same four-legged snake laying curled up under his bed the very next day.

source: 按照黑衣少女的说法，无论是炼气士，还是纯粹武夫，越是境界高深的修行中人，在此地受到的压力就越大，就像铁骑叩关只能死守，全靠一口气绵绵不绝支撑着，一旦开口，就要经受海水倒灌一般的伤害。试想一下，面对迅猛洪水冲来，然后你在堤坝之上开一个小口子试试看？
en_us: According to Ning Yao, for all cultivators, regardless of whether they were qi refiners or pure martial artists, the more advanced their cultivation base was, the more pressure they would be under while in this place. Essentially, all cultivators here were like dams, and the more powerful a cultivator was, the more ferocious the current that they had to keep out. If they wanted to unleash any of their power, then they would have to open up the dam to release their power, and in the process, the fierce current outside would be let in, thereby wreaking havoc in their body.

source: 按照齐先生的规矩，双方对弈，投子无声认输即可，绝对不可言“我输了”三字。
en_us: According to the rules set by Mr. Qi, it was strictly prohibited to verbally declare one's loss, and resignation took place in the form the silence gesture of tossing one's stones onto the table.

source: 按照齐先生订立下来的老规矩，宋集薪和青衫郎要猜子，执黑先行。
en_us: According to the rules set by Mr. Qi, Song Jixin and the azure-robed young boy had to play a minigame of guessing the stones, and the one who received teh black stones would get to go first.

source: 捡了半篓后，陈平安直起腰，仰头望着星空，希冀着能够看到流星划过夜空，只不过今晚显然没有这么好的运气。陈平安回神后，继续凭借依稀星光和过人眼力，做一个财迷该做的事情。
en_us: After filling half of the bamboo basket, Chen Ping'an straightened his back and looked up at the starry sky, hoping to catch a glimpse of a shooting star lighting up the night sky. However, it was clear that he wouldn't be so lucky tonight. After coming back to his senses, Chen Ping'an continued to rely on the faint glow of the stars and his extremely good vision to do what an avaricious should do.

source: 换成是他陈平安的话，今夜绝对睡不安稳。
en_us: If it were Chen Ping'an, he definitely wouldn't be able to sleep so peacefully tonight.

source: 掌心纹路，斑驳复杂。
en_us: There was a complex system of lines on his palm, but there was a brand new line that was slowly elongating, much like a lengthening crack on a piece of porcelain.

source: 掌柜推开后院正屋，看到一位老人坐在椅子上，正在捣鼓他的老旱烟杆子呢，掌柜的关上门后，喊了声老杨头，老人赶紧放下老竹烟杆，倒了一碗茶，笑问道：“掌柜的，有人急着用药？需要我摸黑上山？”
en_us: After opening the door of the main room in the courtyard, Shopkeeper Yang was greeted by the sight of an old man seated on a chair, fiddling with his old-fashioned smoking pipe. Shopkeeper Yang closed the door, then called out to the old man by his nickname, Old Man Yang, and the old man hurriedly set down his pipe, then poured a cup of tea as he asked with a smile, "Is someone in urgent need of medicine? Do you need to me to make a trip up the mountain tonight?"

source: 掌柜的喝了口茶，苦笑道：“刚刚我不是说了嘛，那少年姓刘。老杨头，你也真是的，啥记性！”
en_us: Shopkeeper Yang took a sip of tea, then replied with a wry smile, "Didn't I just tell you that it was a boy with the Liu surname? Your memory is shocking, Old Man Yang!"

source: 掌柜的突然想起一事，“对了，老杨头，你很多年前帮过的一个孩子，就是泥瓶巷那个，小小年纪就给她娘亲抓药的可怜娃儿，他是不是叫陈平安？”
en_us: All of a sudden, a thought occurred to Shopkeeper Yang, and he said, "By the way, I recall that you helped a child from Clay Vase Alley many years ago. It was the poor boy who had to buy medicinal ingredients for his mother from a very young age. Was his name Chen Ping'an?"

source: 接下来一幕，让历经沧桑的齐静春都感到了震惊。
en_us: However, what happened next came as quite a shock, even to Qi Jingchun.

source: 接下来少女微微扬起下巴，“如果在做成这笔买卖之外，你愿意支付给我两袋子铜钱，我就帮你摆平老龙城和云霞山。当然，如果我早早死在刘志茂手里，一切休提，毕竟我现在修为不高，武道九境，才刚刚跻身第六境，作为纯粹武夫的体魄坚韧程度，还不成大气候，至于修行登山的十五重楼，十五层境界，更是只到达中五境里的龙门境，丹室之内，我有六幅图案，尚未成功画龙点睛，也未让天女飞天”
en_us: Ning Yao slightly tilted her chin and continued, "If you're willing to throw in the two other pouches of copper coins in addition to this, I can help you deal with the Old Dragon City and the Dawn Cloud Mountain as well. Of course, you can forget about all of this if I die by the hands of Liu Zhimao. After all, my cultivation base is low, and I've only just reached the sixth tier of the nine tiers of martial arts. As a martial artist, my physique is still yet to reach an accomplished state. As for the 15 tiers of cultivation, I've more so only reached the Dragon Gate Tier of the Middle Five Tiers. I have six patterns in my vital organ, but I've still yet to add the final touch to bring them to life."

source: 接下来青衫少年落子缓慢，谨小慎微，步步为营。宋集薪依旧是落子如飞，大开大合，羚羊挂角。
en_us: During the game, the azure-robed young boy played each turn slowly and carefully, steadily building a foundation, while Song Jixin was playing just as rapidly as usual, going for large and expansive positions.

source: 推车上，角落缝隙里，放着把雪白鞘的长剑，鞘内飞剑，病恹恹的，像是在嫌弃年轻道人找了这么个破落户。
en_us: In a corner of the cart was placed a longsword in a pristine white scabbard. The flying sword was laying within the scabbard in a sullen manner, as if it were silently expressing its displeasure toward the Daoist priest for bringing its owner to such a run-down place.

source: 搁下笔，提起那张符纸，年轻道人吹了吹墨迹，“拿回家后，人站在门槛内，将黄纸烧在门槛外，就行了。”
en_us: The young ist priest set down his brush before picking up the talisman, then blew on it to dry the ink. "Take this home, and all you have to do is burn this outside your doorstep while standing inside your doorstep."

source: 搁置在屋内桌面上的鞘内飞剑，骤然嘶鸣。
en_us: Right at this moment, the flying sword within the scabbard on the table suddenly began to emit a sharp screeching sound.

source: 搬山猿似有心动，不过总算没有出手。
en_us: Bai Yuan was seemingly tempted to take up this offer, but in the end, he ultimately didn't lash out.

source: 搬山猿作为正阳山的顶层角色，见识过太多伏线千里的阴谋诡计，更领教过许多道貌岸然的高人仙人的厉害手腕，哪里肯轻易相信先前儒士的说辞，不过比起先前的言辞激烈，平缓许多，只是冷笑道：“哦？那是我以小人之心度君子之腹？”
en_us: Bai Yuan was a high-ranking member of Sun Scorch Mountain, and he had seen far too many long-term coonspiracies and plots. He had more so experienced the power and might of many sanctimonious immortals. As such, how could he be willing to easily believe Qi Jingchun's words? However, his tone became far calmer than before, and he sneered, "Oh? So you're saying that I'm projecting?"

source: 搬山猿单膝跪地，仍是比小女孩要高，白发老人愧疚道：“小姐，是老奴错了。”
en_us: Bai Yuan immediately fell to one knee, but even so, he was still taller than Tao Zi. A guilt-ridden look appeared on his face as he said, "Please forgive me, Young Mistress."

source: 搬山猿愣了愣，从头到脚打量了一番中年儒士，收起手指，呲牙道：“没劲，泥菩萨也有火气， 不曾想读书人脾气更好，骂也不还口，不晓得是不是打不还手？”
en_us: Bai Yuan faltered upon hearing this. He looked Qi Jingchun up and down before putting down his finger and huffing, "How boring. Even clay statues of Bodhisattvas have a temper, yet who knew that scholars are even more calm and composed. You scholars don't talk back when you're cursed, so I wonder if you also won't strike back when you're attacked?"

source: 搬山猿揉了揉下巴，最后瞥了眼齐静春身后的远处，冷哼道：“算那两个小家伙运气好，转告他们一句，以后别给我碰上！”
en_us: Bai Yuan stroked his chin in thought. In the end, he glanced at someplace far behind Qi Jingchun and humphed, "Those two kids can count themselves lucky. Pass them this message: Don't let me see you in the future! Or else..."

source: 搬山猿沉声问道：“当真？”
en_us: "Truly?" Bai Yuan asked in a solemn voice.

source: 搬山猿犹豫了下，站起身对李氏家主吩咐道：“那就让衙署拿出一份户房档案到李家府上，把那少年的祖宗十八代的底细都翻查清楚，然后护卫这栋院子的人手方面，易精而少，不易杂而多！”
en_us: Bai Yuan hesitated momentarily, then rose to his feet as he turned to Li Hong and instructed, "Get the kiln supervision official's office to give us a copy of that boy's file so we can see his family history going back as far as possible. Also, when selecting guards to protect the manor, make sure to exercise a policy of quality over quantity. I'd also advise you to inform the one above you of what's happened here. Don't try to brush this off as a trivial matter. If something happens to the young mistress, not only will I be unable to bear the consequences, the same would apply to your entire clan as well!"

source: 搬山猿眯起眼，双拳紧握，关节吱吱作响。
en_us: Bai Yuan squinted his eyes, and he clenched his fists so tight that the cracking of his joints could be heard.

source: 搬山猿终于忍不住沉声问道：“方才为何真武山的人去得，我就去不得？齐先生你是不是也太势利眼了？”
en_us: He couldn't suppress his displeasure anymore, and he asked in a solemn voice, "Why did you allow the deity from True Martial Mountain to go just then? Yet, you stopped me from going? Mr. Qi, are you being too biased?"

source: 搬山猿自以为猜出事情缘由，怒气更盛，“那少女果然是你齐先生挑中的晚辈，若是齐先生早就对刘氏剑经心动，大可以与我明言！只要不落入风雷园之手，被齐先生你的不记名弟子拿去，便拿去了。可是齐先生你偏偏如此藏藏掖掖，怎么，既想着当婊子又想要立贞节牌坊？好处由你齐静春偷偷拿走，恶名却要我正阳山来背？！”
en_us: Bai Yuan felt like he understood the situation, and this caused him to become even more enraged. "Sure enough, that young girl is your disciple, Qi Jingchun! If you're coveting the Liu Clan's sword scripture, you can be frank and admit it to me! As long as it doesn't end up in Wind Lightning Field's hands, I don't care if your secret disciple takes it or not. However, you insist on being so secretive. What, you want to reap all the benefits for yourself, yet you want to maintain your reputation as a noble scholar at the same time? You reap the benefits, yet I have to sacrifice my reputation?!"

source: 搬山猿转身大步离去，背对着齐静春，老猿突然高高抬起一条胳膊，竖起一根大拇指。
en_us: Bai Yuan turned around and strode away. With his back to Qi Jingchun, the old ape suddenly lifted a hand and stuck up his thumb.

source: 搬山猿问道：“齐静春，你一定要拦阻我进去？”
en_us: "Qi Jingchun, do you insist on blocking me?" Bai Yuan asked.

source: 摆明了我已上钩，你来杀便是。
en_us: He was making it clear that he was knowingly walking into the trap, provoking Chen Ping'an to attack him if he dared.

source: 摇摇晃晃，像个醉醺醺的酒鬼。
en_us: He swayed and wobbled, and it was as if he were a hopeless drunk.

source: 摊上这么个一根筋的奇怪姑娘，他也没辙啊。
en_us: Against such a stubborn and strange girl, he truly didn't know what to do.

source: 摸上去比较湿润，但其实并不是水性土，恰恰相反，而是火性土，不过属于火性土的最后一种，按照姚老头的说法，这叫“七月流火壤”，土性会自行转为温凉，不算太燥，可塑性强，而且这意味着加固井壁的时候，不易塌方，是好事情。
en_us: The soil felt slightly moist, yet it wasn't actually water-characteristic soil. Instead, it was the complete opposite, and it was fire-characteristic soil. However, it was the bottom type of fire-characteristic soil. According to Old Man Yao, this type of soil was called the "Seventh Month Fiery Star Soil". This type of soil would naturally become cool, and it wasn't too dry either. It was also extremely workable, and this ensured that the walls of the well wouldn't collapse too easily. This was a good thing.

source: 撼山？
en_us: Mountain Shaking?

source: 故而在旁门左道的野路子修士当中，流传着一句脍炙人口的口头禅：替人收尸，必有好报。
en_us: Hence, there was a popular saying among shady and disreputable cultivators, which was that there was sure to be rewards to be reaped from burying the dead.

source: 故而对于小镇四字匾额“气冲斗牛”，少女是真的看不上眼。
en_us: Hence, she the plaque in the town that contained the idiom "unmatched aura" hadn't been able to catch much of her interest.

source: 敲门之人是卢正淳，自然是以妇人为首，此外还有两名卢氏忠仆。
en_us: The person at the door was none other than Lu Zhengchun. However, he was naturally serving the woman standing next to him. In addition to them, there were also two loyal servants from the Lu Clan.

source: 整个人沐浴在洁白光辉当中，丝丝缕缕的光线，不断摇曳。
en_us: The figure's entire body was basked in pristine white radiance, and the rays of light were swaying incessantly.

source: 整座小天地也跟着晃了一晃。
en_us: The entire small world also shuddered.

source: 整座廊桥以及廊桥之外，突然又变得伸手不见五指。
en_us: The entire covered bridge and the area outside of it abruptly became pitch black once again.

source: 整条溪水也晃了一晃。
en_us: The entire creek also shuddered.

source: 斩却心魔，正是机缘。
en_us: This was a perfect opportunity for her to overcome an internal demon.

source: 方寸之间，大是壮观。
en_us: The human heart was filled with grandeur.

source: 旁边的陈平安有些呆滞，这家伙一点都不像是在开玩笑，很一本正经，虽然绝对跟“有理有据”八竿子打不着，可你又不能说他纯粹在胡说八道。
en_us: Walking next to him, Chen Ping'an couldn't help but feel slightly stupefied. Liu Baqiao didn't look like he was joking at all. In fact, his expression was completely serious. Even though his words couldn't be regarded as reasonable, they couldn't be simply dismissed as unreasonable either.

source: 无人关注的婢女稚圭，站在原地，寂静无声，某个瞬间，她眼眸当中，浮现出两双淡金色的眼瞳，一眼双瞳。
en_us: Meanwhile, Zhi Gui remained standing on the spot in silence, but all of a sudden, a pair of golden pupils appeared in each of her eyes, only to vanish just as abruptly as they had appeared.

source: 无依无靠的泥瓶巷少年，被那些个外乡人一口一个泥腿子贱命，市井陋巷刨土吃的蝼蚁。
en_us: Chen Ping'an had no one to rely on, and he was seen as a pitiful and insignificant ant by all of the outsiders visiting the town, but he still had his own life to live.

source: 无数星星点点的火光，在空旷的屋子里随处乱窜，绚烂壮观。
en_us: Countless bright and flashing sparks chaotically shot around the spacious room, appearing dazzling and spectacular.

source: 既然是崔明皇发话，刘灞桥不敢多待，便跟着两人赶往福禄街，只是离去之时，下意识多瞥了眼那个愁眉苦脸的中年汉子。
en_us: Liu Baqiao didn't dare to keep Cui Minghuang waiting, so he followed the two of them to Fortune Street, but right as he left, he reflexively took a glance at the sulky middle-aged man who was still squatting on the ground.

source: 既然那位圣人认可了顾粲本身即是机缘，那就意味着这个孩子可以带走属于他自己的机缘。
en_us: Since the Sage approved of the fact that Gu Can himself was a fated opportunity, this also implied that the child could bring away the fated opportunities that belonged to him.

source: 早知道如此，宁姚就干脆不接这果子了。
en_us: If she had known this from the very beginning, then she wouldn't have accepted the fruits in the first place.

source: 时间，天地寂寥，万籁寂静。
en_us: Following the intervention of this authoritative voice, everyone immediately fell silent.

source: 昏黄灯火中，少女长眉微弯，如春风压弯了一束桃枝。
en_us: The dim yellow light illuminated the slight twitching of the young girl's long and slender eyebrows. It was like the branch of a peach tree slightly bending under the gentle spring breeze.

source: 昔年有少年求学于观湖书院，书法通神，名动朝野，被南魏国主召入皇宫，于侧殿撰写诏书，正值隆冬大雪，笔冻不能书，帝敕令宫嫔十余人侍于左右身侧，为其呵笔。
en_us: In the past, there had once been a youth who had sought knowledge at Lake View Academy. His calligraphy skills had been divine, and his renown had echoed throughout the imperial palace. The ruler of the Southern Wei Nation had invited him into the palace to compose imperial decrees in a side palace. During winter, the heavy snow and biting cold had been such that his calligraphy brush had become frozen and unable to produce any words. Learning this, the emperor had ordered a dozen or so of his retainers to assist the young scholar and use their breaths to warm his brush.

source: 春。天下迎春。
en_us: Spring — The world welcomes spring.

source: 春寒料峭，原本衣衫单薄的陋巷少年，今天出现在老猿眼前的时候，明显要穿着厚实许多，除了自己衣衫之外，还找了一件高大少年刘羡阳的宽大旧衣，套在最外边，在两件衣衫之间，另有玄机。原来少年给自己做了一件“木瓷甲”，六块长条熟木板分别钻孔，以丝绳串连系紧，胸前三块后背三块，最重要的是这具简陋至极的木甲之上，镶嵌有密密麻麻的小碎瓷片。
en_us: Normally, Chen Ping'an was dressed very lightly, but on this day, as he appeared before Bai Yuan, he was clearly wearing far thicker clothes than before. Aside from his own clothes, he had also dressed himself in one of Liu Xianyang's old robes, which fit him very loosely. He had donned this extra piece of clothing in order to conceal something. As it turned out, he had forged a suit of wood porcelain armor for himself. The suit of armor consisted of six long wooden planks that had had holes drilled into them before being tied securely together with rope through those holes. There were three planks in front of his chest, and three more planks on his back. Most importantly, the extremely crude suit of wooden armor was embedded with countless tiny porcelain shards.

source: 春雨细微，不过是让街上行人脚步匆匆，远未到檐下躲雨的地步。
en_us: The spring rain was light, and it simply hastened the footsteps of those on the streets. However, it was still far from compelling them to hide under the eaves.

source: 春雷震动，蛰虫惊而出走。
en_us: The spring thunder rumbled, and the startled insect scattered.

source: 春风和煦，竹叶摇曳，如翻书声。
en_us: The spring breeze was as gentle as ever, and the rustling of the bamboo leaves resembled the sound of a book's turning pages.

source: 春风少年很得意。
en_us: The young boy felt extremely proud as he sat in the spring breeze.

source: 春风拂面，读书人双手负后，少女背着少年。
en_us: A gentle spring breeze brushed over them, with the scholar walking with his hands clasped behind his back and the young girl walking with a young boy resting on her back.

source: 春风里，两个少年一起走着。
en_us: The two youths walked amid the spring breeze.

source: 春风里，高大少年憧憬着未来，草鞋少年细嚼着草根，一个说，一个听。
en_us: Walking through the gentle spring breeze, the tall young boy dreamed about a bright and exciting future. Meanwhile, the young boy in straw sandals chewed the straw in his mouth. One person spoke, and one person listened.

source: 是个中年男人，背负长剑，腰间悬佩虎符。
en_us: This was a middle-aged man with a sword strapped to his back and a tiger talisman tied to his waist.

source: 是杏花巷马婆婆的孙子，从小就被人当做傻子，加上马婆婆在陈平安这辈少年心中，印象实在糟糕，吝啬且刻薄，连累她的宝贝孙子被人当做出气筒，少年之前每次出门，给人追着欺负，每逢穿新衣新靴，不出半个时辰，板上钉钉会被同龄人或是大yi些的少年，折腾得满是尘土，试想yi下，yi双马婆婆刚从铺子里买来的崭新靴子，孙子穿出门后，立即被十几号人yi人yi脚踩踏之后，等孩子回家之后，靴子能新到哪里去？
en_us: This young boy was Granny Ma's grandson, and he had been treated as a retard by the others ever since he was very little. Moreover, Granny Ma's reputation was extremely poor among the children who were around Chen Ping'an's age, and she was seen as someone who was both stingy and unkind. As a result, many of them treated her darling grandson as an outlet to vent their anger. The young boy was chased and bullied every time he left home. Whenever he wore new clothes or shoes, it was guaranteed that they would become dirty within an hour thanks to the mean actions of the other children. For example, when Granny Ma bought a new pair of shoes for him, a dozen or so children would immediately step on his feet and trample all over his shoes. When he returned home, would the shoes still appear new?

source: 是福禄街的卢家大少卢正淳，当年就是此人带着一帮狐朋狗友，把刘羡阳堵在这条巷子，差点把他活活打死，如果不是陈平安跑去喊那几嗓子，家中已无长辈亲戚的刘羡阳，恐怕就真要被扔去乱葬岗了。
en_us: The person standing before them was Lu Zhengchun, the young master of Fortune Street's Lu Clan. Many years ago, it was none other than this person and his friends who had trapped Liu Xianyang in this alley and almost beaten him to death. If it weren't for Chen Ping'an's cries for help, Liu Xianyang, who had no relatives, might have truly been killed and tossed into an unmarked grave.

source: 是那位身穿白衣腰系玉带的窑务督造官，大步走出门槛，向墙头这边笑脸望来。
en_us: This person was none other than the kiln supervision official who was dressed in white. He looked over with a smile as he strode out of Song Jixin's house.

source: 显然早就心里有数，只是跟少女打趣罢了。
en_us: It was clear that he already knew the answer. He was merely joking around with the young girl.

source: 显然是在提醒那看门汉子，他们两人之间，可是有着五钱的香火情。
en_us: He was clearly reminding the gatekeeper that he still owed him five coins for his work.

source: 显而易见，气势汹汹的杀人为假，诱使少女冒失出剑为真。
en_us: It was clear that his attack had only been a facade, with his true intention being to invite a careless attack from Ning Yao.

source: 显而易见，铁匠阮师傅即便不是挖凿水井的行家，也绝对不是外行人。
en_us: Even though Master Ruan wasn't an expert when it came to digging wells, it was very clear that he wasn't an amateur either.
